ROTORS = {
    'А': {
        'alpha1': 'ЛТЗАЖНЫЦУМХЩСБЧШОЯКГЮФВЙЬРИПДЕ',
        'alpha2': 'ЙУСЛДЩБЮГПЖЕЦОРВНЬХФМИЧЯТЫАКЗШ',
        'alpha3': 'ЬЕЙПУИЗЛЦМОЖГВНКБЮФЫШХДСТЯРАЧЩ',
        'steps':   [3,7,11,2,9,5,1,8,4,6,10,3,7,2,9,11,5,8,1,4,10,6,3,7,2,9,5,11,8,4]
    },
    'Б': {
        'alpha1': 'КЗШПЩУЯЧСЫНГВЬЛИТЖОЦРЮАХДЙМБЕФ',
        'alpha2': 'ЫЩГРТДКИЕЛЬЗФХМЦЖОЯШАВЮБНПЧЙУС',
        'alpha3': 'ЮЫХЩУАКЦЛТПСЖИОШЧДМЗЬБГВФНРЯЕЙ',
        'steps':   [2,9,7,11,4,1,6,10,3,8,5,2,9,11,7,4,1,6,10,3,5,8,2,9,4,11,7,1,6,10]
    },
    'В': {
        'alpha1': 'ПДЕМНТЙВЗРОУШЯАФЬХБСЧЦИКЖЛЮЫЩГ',
        'alpha2': 'БЕФЫУЗХАШЙТСИЖПЮДНЬВЛЧМОЩКРЯГЦ',
        'alpha3': 'ОЮДАТХГСЦЖБШРЙМЬУПЕЩКЛИЫЗЧЯФНВ',
        'steps':   [7,3,8,2,10,5,11,4,9,1,6,7,3,8,2,10,5,11,4,1,9,6,7,3,2,8,10,5,11,4]
    },
    'Г': {
        'alpha1': 'ЯГЦЙЗЕОМФКДШЮНЫЧЩТЖИПАРЬУБЛХСВ',
        'alpha2': 'ХСВКЕГЬРЦБЩФЧТЙАУДНЮЫМЛЖЗЯПОШИ',
        'alpha3': 'МОПХЖДИШСРЛЬЯВЕКТБНАГЦЙЮЩУФЗЧЫ',
        'steps':   [11,6,9,5,1,4,10,7,2,8,3,11,6,9,5,1,4,10,7,8,2,3,11,6,5,9,1,4,10,7]
    },
    'Д': {
        'alpha1': 'ОШИБГСЖЛВЯУЦАДКМЗЩТЧЙРПНЕХЫЬФЮ',
        'alpha2': 'ЬФЮЯСШНПИХЗВМЩБРЕУДАКЛЫТГОЙЖЦЧ',
        'alpha3': 'ЕМБДРПЙЬШЯЦКФЫНГЖЛЧХИСВОАТЗЩУЮ',
        'steps':   [1,5,10,4,7,11,3,9,6,2,8,1,5,10,4,7,11,3,9,2,6,8,1,5,4,10,7,11,3,9]
    },
    'Е': {
        'alpha1': 'ЖЦЧХШФТЫЮОЕИРУЯЛГЗЩМБПЙДСЬКНВА',
        'alpha2': 'НВАОФЦДЙЧЬГЮЛЗХПСЕУРЯЫКЩШЖБТИМ',
        'alpha3': 'НЕЛПЯБВКЬФСГЗЮЧИРЦУДЙШЫМХЖЩАТО',
        'steps':   [4,8,11,3,5,9,2,6,7,10,1,4,8,11,3,5,9,2,6,10,7,1,4,8,3,11,5,9,2,6]
    },
    'Ж': {
        'alpha1': 'ТИМЬЦВЩКАЖСЧПЕОЫШГЗЛХЙБУФНЯДЮР',
        'alpha2': 'ДЮРЖВИУБМНШАЫГЬЙФСЕПОКЯЗЦТХЩЧЛ',
        'alpha3': 'ЧНЦБФЛЫГКЗШИЩОУЙЯСТПВЬЮЕДРАХЖМ',
        'steps':   [8,4,1,10,6,3,9,2,11,7,5,8,1,4,10,6,3,9,2,7,11,5,8,4,10,1,6,3,9,2]
    },
    'З': {
        'alpha1': 'ЩЧЛНИЮЗЯРТФМЙСЖКЦШГЫЬБХЕВДОУАП',
        'alpha2': 'УАПТЮЧЕХЛДЦРКШНБВФСЙЖЯОГИЩЬЗМЫ',
        'alpha3': 'УЧСЛЗЦЮИГЩЬЙАМТВФШЖБЫКОНПЯХДРЕ',
        'steps':   [11,6,2,9,5,7,1,4,10,3,8,11,6,2,9,5,7,1,4,3,10,8,11,6,9,2,5,7,1,4]
    },
    'И': {
        'alpha1': 'ЗМЫДЧАГОПЩВЛБФТЯИЦШКНХЬСЮУЖЕРЙ',
        'alpha2': 'ЕРЙЩАМСЬЫУИПЯЦДХЮВФБТОЖШЧЗНГЛК',
        'alpha3': 'ТУШЦЩСОЙИАКВХЕЖЫЗЬРЛЮГМЧБФДПЯН',
        'steps':   [7,3,8,2,10,5,11,1,9,4,6,7,3,8,2,10,5,11,1,4,9,6,7,3,2,8,10,5,11,1]
    },
    'Й': {
        'alpha1': 'СПБЗРЛФНКЕЧЙОИУЬАЮВХЩЖТЦМГДШЫЯ',
        'alpha2': 'ГЛКУМРШЖЙЗЮЫХВЩОЧИЦЯДЬНФАЕТСПБ',
        'alpha3': 'ЖТЬСАШМВЙХГЫДНРЮЩКЯЦОИЕУЛЗПБФЧ',
        'steps':   [1,5,10,4,7,11,3,9,6,2,8,1,5,10,4,7,11,3,9,2,6,8,1,5,4,10,7,11,3,9]
    },
    'К': {
        'alpha1': 'ШЫЯЕЛПЦТБГАКЬЮЗЖМЧИОУНДВРСЩФЙХ',
        'alpha2': 'ФЙХГПЫВДЯСМБЖЧЕНРАЮЬЗТЩИЛШУЦКО',
        'alpha3': 'РЖКШХЬЕЫВДИЮПЧЯОАГФСМЙНТЦЩБЛЗУ',
        'steps':   [9,2,6,8,1,4,10,7,3,11,5,9,2,6,8,1,4,10,7,11,3,5,9,2,8,6,1,4,10,7]
    },
    'Л': {
        'alpha1': 'ЦКОСЫЙИЩХШРЯНАГТЛМЧЖЕДУЮПФЗВБЬ',
        'alpha2': 'ВБЬШЙКЮУОФЛХТМСДПРАНГЩЗЧЫЦЕИЯЖ',
        'alpha3': 'ЯРГЬДКНЮЫПЙОБУФМХИЗШЕВЧЖСАЛЦЩТ',
        'steps':   [4,8,11,3,5,9,2,6,7,10,1,4,8,11,3,5,9,2,6,10,7,1,4,8,3,11,5,9,2,6]
    },
    'М': {
        'alpha1': 'ИЯЖФКБЧЗЬЦПОДРШЩЫЛМТСУЕАЙВГЮХН',
        'alpha2': 'ЮХНЦБЯАЕЖВЫЬЩЛФУЙПРДШЗГМКИСЧОТ',
        'alpha3': 'ФЯИКПГЧОЮБВМЛТЗЕДЙЩЬНЫУРШХЦСАЖ',
        'steps':   [10,1,5,7,2,8,4,11,3,6,9,10,1,5,7,2,8,4,11,6,3,9,10,1,7,5,2,8,4,11]
    },
    'Н': {
        'alpha1': 'ЧОТВЯХМГНИЙЖУПЦЗКЫЛЩФЕСРБЮШАЬД',
        'alpha2': 'АЬДИХОРСТЮКНЗЫВЕБЙПУЦГШЛЯЧФМЖЩ',
        'alpha3': 'ЗФЙГБИУМОЛЫЕЦЖЩНПВАКЧЮТЯЬДСШХР',
        'steps':   [6,11,9,1,3,10,8,5,2,4,7,6,11,9,1,3,10,8,5,4,2,7,6,11,1,9,3,10,8,5]
    },
    'О': {
        'alpha1': 'МЖЩЮОЬЛШДЧБТЕЙИГЯКЫЗВСФПХАЦРНУ',
        'alpha2': 'РНУЧЬЖПФЩАЯДГКЮСХБЙЕИШЦЫОМВЛТЗ',
        'alpha3': 'ЩЗВИЛЙТЕМЦЮНСРАЧБЫХГУОЖФКПШЬДЯ',
        'steps':   [5,10,2,11,4,7,1,3,8,9,6,5,10,2,11,4,7,1,3,9,8,6,5,10,11,2,4,7,1,3]
    },
    'П': {
        'alpha1': 'ГМЬЯЕФЙЩАПРЦОЖНСЛБХЗИКШЫЧТЮУДВ',
        'alpha2': 'ПОЮМЧЬИХЩВТШЖЙЫЦБГДСАУНРФЛКЗЕЯ',
        'alpha3': 'АЩЫЙЦВЖНЕСОЧШЯХУЛЮДИТМРЗГБЬКПФ',
        'steps':   [8,4,1,10,6,3,9,2,11,7,5,8,4,1,10,6,3,9,2,7,11,5,8,4,10,1,6,3,9,2]
    },
    'Р': {
        'alpha1': 'МИЗЙЮУХЧЕОГРАЩЛЫВЯФНДЦТБКПСШЬЖ',
        'alpha2': 'ЯЙУЖЬКЩЕДМБЫИАТНПВЧШХСРЛЮГЗЦФО',
        'alpha3': 'ХАЮВСЫРЧНШМУЬФДТЦОПЙЖЕЯЩИЛКГБЗ',
        'steps':   [2,9,7,3,11,5,8,1,6,4,10,2,9,7,3,11,5,8,1,4,6,10,2,9,3,7,11,5,8,1]
    },
    'С': {
        'alpha1': 'ОАСИКЗДФЧЖПТЩХБРЯМЬЫЕШЛГУВЦНЮЙ',
        'alpha2': 'ЖЩЦАУСЕЬФЙВЛХДГТМОЮРЧНБПЗЯШЫКИ',
        'alpha3': 'ДХОЫШЮЯУЧЬЕТКЗПЖСМБВРНФАЙЦГИЛЩ',
        'steps':   [7,3,8,2,10,5,11,4,9,1,6,7,3,8,2,10,5,11,4,1,9,6,7,3,2,8,10,5,11,4]
    },
    'Т': {
        'alpha1': 'ВЖКОФЮАДХЯЛНЙИРШГПЕЦЩЗЫТЬБУСЧМ',
        'alpha2': 'АЕЫДЦНЬУКЩОПЧФЯГЙИЗБЮТВМШЖРЛСХ',
        'alpha3': 'ПДМЮЬОФТУКНЖГЩБРШЕЛЫЯЧЗХВСИЙЦА',
        'steps':   [11,6,9,5,1,4,10,7,2,8,3,11,6,9,5,1,4,10,7,8,2,3,11,6,5,9,1,4,10,7]
    },
    'У': {
        'alpha1': 'ИДНХСШФКЮАМГЕЧВБЖЙУЛЬРПЯЦОЫТЗЩ',
        'alpha2': 'ЙХШЩЗЦЧЮЬИЯБДЕПЛОЖКТФЫГВСМНРУА',
        'alpha3': 'БПЕОКМЗЖТГЧРИАЛЯЬНЦЮФУЩДЫШЙВСХ',
        'steps':   [1,5,10,4,7,11,3,9,6,2,8,1,5,10,4,7,11,3,9,2,6,8,1,5,4,10,7,11,3,9]
    },
    'Ф': {
        'alpha1': 'ЩЧРЕШЫЮЗУХЖВФЬМПИАСГКЛЯОНЙТБЦД',
        'alpha2': 'ДЬЛФЫТУЦСЕИМЮКЖЯЩХШВЗГОЙРАБПНЧ',
        'alpha3': 'ЛБНМГЕЩРЖИУЯЙХЦФКЧСОЗТАПЮЬВЫШД',
        'steps':   [9,2,6,8,1,4,10,7,3,11,5,9,2,6,8,1,4,10,7,11,3,5,9,2,8,6,1,4,10,7]
    },
    'Х': {
        'alpha1': 'ХФТЧНРКСЗДЙЯЬЮОВАЩЦПУБМЖЫИЛГШЕ',
        'alpha2': 'ЕЮБЬРЛЗШЦЧАОКУЙМХДНЯСПЖИТЩГВЫФ',
        'alpha3': 'ЦЛЧЕИНАЯРЙТФВДСЗГУШМЩЖХБОКЫЮЬП',
        'steps':   [4,8,11,3,5,9,2,6,7,10,1,4,8,11,3,5,9,2,6,10,7,1,4,8,3,11,5,9,2,6]
    },
    'Ц': {
        'alpha1': 'ЧКГЮТБСНШФЩЖУЗИОДЕЫМЦВЙАЛХПЯРЬ',
        'alpha2': 'ЮСЯЗГВНТРКЕАЦШХИФЬЛЙЫОЩДПЧМЖБУ',
        'alpha3': 'СЦУНЙЧХФЯВЖЗЫПШЩИТЬЕАРДЛМГЮОКБ',
        'steps':   [10,1,5,7,2,8,4,11,3,6,9,10,1,5,7,2,8,4,11,6,3,9,10,1,7,5,2,8,4,11]
    },
    'Ч': {
        'alpha1': 'ФУПКЛГЦЫНЬХЙЗСАЖЕЧРОШЯИЩБДВМТЮ',
        'alpha2': 'ЬЗВУБПШРЫЮДИСЦЩЙЧФТЖНМАХГЕЯОЛК',
        'alpha3': 'ШСТЧВУДЗФЫРЩЮБЬАЙЖКНХЯПЦЕИОМГЛ',
        'steps':   [6,11,9,1,3,10,8,5,2,4,7,6,11,9,1,3,10,8,5,4,2,7,6,11,1,9,3,10,8,5]
    },
    'Ш': {
        'alpha1': 'КЦМСПЯЫЛТУЧЩШНДАЬЮБИРЖХЕВФОЙГЗ',
        'alpha2': 'УШОЦВМРБЛЗФХНЫЕЩЮКГАТЙДЧЯЬЖИПС',
        'alpha3': 'ЬШЖУЫТПЩЗЮЯАОЛКХВРГЧДФБСНЙМЕИЦ',
        'steps':   [3,7,4,6,9,2,5,8,1,11,10,3,7,4,6,9,2,5,8,11,1,10,3,7,6,4,9,2,5,8]
    },
    'Щ': {
        'alpha1': 'ЗНЖШЯОТГБСЬДЫРЧХКУПЩЛИЕФМЮЙАВЦ',
        'alpha2': 'СЫЙНМЖЛПГЦЮЕРТФДУЗВХБАЧЬОКИЩЯШ',
        'alpha3': 'КЬРТЮЖБАЩОФХМЦГДЫЯИУПЗЛШЧВЕНЙС',
        'steps':   [5,10,2,11,4,7,1,3,8,9,6,5,10,2,11,4,7,1,3,9,8,6,5,10,11,2,4,7,1,3]
    },
    'Ы': {
        'alpha1': 'ЦРИЫОЙБВПШКЧТЛЬЕЗСЯДГЩФЮЖУАХМН',
        'alpha2': 'ШТАРЖИГЯВНУФЛБЮЧСЦМЕПХЬКЙЗЩДОЫ',
        'alpha3': 'ГКЯЖОРЛХАМЗДЕСИПЮФЙТБЩЦЬУЫНЧВШ',
        'steps':   [2,9,7,3,11,5,8,1,6,4,10,2,9,7,3,11,5,8,1,4,6,10,2,9,3,7,11,5,8,1]
    },
    'Ь': {
        'alpha1': 'НЛЩТЙАПМЯЫЗЬБГКФЦШОЧВДЮУИСХЕЖР',
        'alpha2': 'ЫБХЛИЩВОМРСЮГПУЬШНЖФЯЕКЗАЦДЧЙТ',
        'alpha3': 'ИГФРМЯЦДХЕЩПНШЙБОЗВЖЛАСКТЮЧУЫЬ',
        'steps':   [8,4,1,10,6,3,9,2,11,7,5,8,4,1,10,6,3,9,2,7,11,5,8,4,10,1,6,3,9,2]
    },
    'Ю': {
        'alpha1': 'РГДБАХЯЖОТЦКПВЗЮНЫЙЬМЧУСЩШЕФИЛ',
        'alpha2': 'ЛВЧПХЕОИЙБНЗЯМЦУРТАКЖЬСШДЫФЮЩГ',
        'alpha3': 'ЙИЗЯЕФСПДНАБЧЬВЛМЩЫРЦХШГЖОУТЮК',
        'steps':   [10,1,5,7,2,8,4,11,3,6,9,10,1,5,7,2,8,4,11,6,3,9,10,1,7,5,2,8,4,11]
    },
    'Я': {
        'alpha1': 'ТПЕГЩДМЙЖЛШУВЯСКЫРИЮОФЗЦХНЧЬАБ',
        'alpha2': 'БЯФВДЧЖАИГЫСМОШЗТЛЩУЙЮЦНЕРЬКХП',
        'alpha3': 'ВЙЩФНЗШБПЧХЛУКЫЦЕАЮЯСДЬИРМТЖОГ',
        'steps':   [5,10,3,1,8,11,6,4,9,2,7,5,10,3,1,8,6,11,4,9,2,7,5,10,1,3,8,6,11,4]
    }
}